// 1. Створити пустий масив та :
//     a. заповнити його 50 парними числами за допомоги циклу.
const arrEven = [];
for (let i = 0; i < 50; i++) {
    arrEven[i] = 2 * i;
}
console.log(arrEven);
console.log('-----------------------------------------------------')

// b. заповнити його 50 непарними числами за допомоги циклу.
const arrEven1 = [];
for (let i = 0; i < 50; i++) {
    arrEven1[i] = 2 * i + 1;
}
console.log(arrEven1);
console.log('-----------------------------------------------------')
// c. Заповнити масив 20ма рандомними числами. (Google: Generate random number JS)

let arr1 = []
for (let i = 0; i < 20; i++) {
    arr1[i] = Math.floor(Math.random() * 100);
}
console.log(arr1)
console.log('-----------------------------------------------------')
// d. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732 (Google: Generate random number JS)





let generalArr = [134, 2345, 678, 234, 12315, 73254, 12123, 20, 25, 15, 35, 50, 10]

// 2. Вивести за допомогою console.log кожен третій елемен

for (let i = 0; i < generalArr.length; i += 3) {
    const arr1Element = generalArr[i];
    console.log(arr1Element)
}

console.log('-----------------------------------------------------')
// 3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.

for (let i = 0; i < generalArr.length; i += 3) {
    const arr1Element = generalArr[i];
    if (arr1Element % 2 === 0) {
        console.log(arr1Element)
    }
}

console.log('-----------------------------------------------------')


// 4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
let array = []
for (let i = 0, a = 0; i < generalArr.length; i += 3) {
    if (generalArr[i] % 2 === 0) {
        array[a] = generalArr[i];
    }

}
console.log(array)


console.log('-----------------------------------------------------')


// 5. Вивести кожен елемент масиву, сусід справа якого є парним
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
let numberArr = [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ]
for (let i = 0; i < numberArr.length; i++) {
    if(numberArr[i+1] % 2 === 0 ){
        console.log(numberArr[i])
    }

}
console.log('-----------------------------------------------------')

// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній
// чек.  7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// 8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом -
// додати його в інший масив.
